package models

/*

{
    "ret_num": 1574,
    "ret_array": [
        {
            "_id": 30836532478,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.指特定范围内的任何一个或一组：～人。～回。～组。 2.指特定范围内逐一出现的任何一次：～战必胜。～况愈下。 3.虽：“～有良朋，况也永叹”（虽有良朋好友，危难之时也只能为之长叹）。 4.古同“们”，中国宋元代口语。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "每"
            ],
            "pinyin": [
                "měi"
            ],
            "radicals": [
                "母"
            ],
            "sid": [
                "04199a1cd7714c19a96eff44bb68dd02"
            ],
            "stroke_count": [
                "7"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 32984011361,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "[huán]：1.回到原处或恢复原状：～乡。～俗。衣锦～乡。返老～童。 2.回报别人对自己的行动。～手。～击。以眼～眼。以牙～牙。 3.偿付：归～。偿～。～本。原物奉～。 4.古同“环”，环绕。 5.姓。 [hái]：1.依然，仍然：这本书～没有看完。 2.更加：今天比昨天～冷。 3.再，又：锻炼身体，～要注意休息。 4.尚，勉强过得去：身体～好。 5.尚且：他～搬不动，何况我呢？"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "还"
            ],
            "pinyin": [
                "huán",
                "hái"
            ],
            "radicals": [
                "辶"
            ],
            "sid": [
                "0102895ea9784bce9d91ec5f0e73dbfb"
            ],
            "stroke_count": [
                "7"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 31876713663,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.由于下雨时带异性电的两块云相接，空中闪电发出的强大的声音：～电。～鸣。～动。～雨。～霆。～厉风行。 2.军事用的爆炸武器：地～。鱼～。布～。扫～。～管。 3.〔～池〕古水名，在今中国安徽省望江县。现用于成语“不敢越～～一步”，喻不敢越出一定的范围。 4.姓。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "雷"
            ],
            "pinyin": [
                "léi"
            ],
            "radicals": [
                "雨"
            ],
            "sid": [
                "1f52d9d4c0294d11ad758c6b0f411d2d"
            ],
            "stroke_count": [
                "13"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 31792828482,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.轻打，拍：～粉。～蝇。～打。 2.击拂的用具：粉～。 3.冲：～灭。～救。 4.相搏击：相～。～跌。 5.跌倒：～地。 6.伏：～在桌上看书。 7.杖，戒尺，亦为中国周代九刑之一。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "扑"
            ],
            "pinyin": [
                "pū"
            ],
            "radicals": [
                "扌"
            ],
            "sid": [
                "037e43348bf54a0ea2099dec90cf84d2"
            ],
            "stroke_count": [
                "5"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 30853304610,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.生物体发生不健康的现象：疾～。～症。～例。～痛。～情。～源。～愈。～变。～危。～逝。～榻。～残。 2.缺点，错误：语～。通～。弊～。 3.损害，祸害：祸国～民。 4.不满，责备：诟～。 5.烦躁，担忧：“郑人～之”。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "病"
            ],
            "pinyin": [
                "bìng"
            ],
            "radicals": [
                "疒"
            ],
            "sid": [
                "0e151ecc0dad4a329442244a8787283c"
            ],
            "stroke_count": [
                "10"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 33906753607,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.还，走向原来的地方：～家。 2.掉转：～首（回头看）。～顾。～眸。～暧。妙手～春。 3.曲折，环绕，旋转：～旋。～肠。～廊（曲折回环的走廊）。 4.答复，答报：～信。～话。～绝。 5.量词，指事件的次数：两～事。 6.说书的一个段落，章回小说的一章：且听下～分解。 7.中国少数民族，分布于中国大部分地区：～族。～教（中国称伊斯兰教）。 8.姓。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "回"
            ],
            "pinyin": [
                "huí"
            ],
            "radicals": [
                "囗"
            ],
            "sid": [
                "05995c787dcd41b8a28ca9cf70366730"
            ],
            "stroke_count": [
                "6"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 31323068152,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.睡觉：安～。长～。失～。 2.某些动物一定时期内像睡眠那样不食不动：初～。冬～。 3.倒卧：一日三～三起。 4.横放：“～琴绿阴”。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "眠"
            ],
            "pinyin": [
                "mián"
            ],
            "radicals": [
                "目"
            ],
            "sid": [
                "08e9094f38cb4f97875b05daa9aa5326"
            ],
            "stroke_count": [
                "10"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 33772541116,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.气味好闻，与“臭”相对：～味。～醇。芳～。清～。 2.舒服：睡得～。 3.味道好：这鱼做得真～。 4.受欢迎：这种货物在农村～得很。 5.称一些天然或人造的有香味的东西：麝～。灵猫～。龙涎～。檀～。沉～。 6.旧时用以形容女子事物或作女子的代称：～闺。～艳。 7.祭祖、敬神所烧的用木屑搀上香料做成的细条：～火。烧～拜佛。～炉。～烛。 8.姓。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "香"
            ],
            "pinyin": [
                "xiāng"
            ],
            "radicals": [
                "香"
            ],
            "sid": [
                "1f77c83c973649a49ea1e876cae37ceb"
            ],
            "stroke_count": [
                "9"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 33034348979,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.哀怜：怜～。～恤。～惜。～恻。 2.忧愁：～默。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "悯"
            ],
            "pinyin": [
                "mǐn"
            ],
            "radicals": [
                "忄"
            ],
            "sid": [
                "27c0fa446d514057a308952868710147"
            ],
            "stroke_count": [
                "10"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 33034341170,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.人或动物在水里行动：～泳。～水。 2.不固定：～资。～走。～牧。～行。～学（古指离开本乡到外地或外国求学）。～击。～弋。～离。～子（离家久居外乡的人）。 3.河流的一段：上～。中～。下～。 4.交往，来往：交～。 5.从容地行走：周～。～历。～逛。～兴（xìng）。～记。～说（shuō）。～山玩水。 6.姓。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "游"
            ],
            "pinyin": [
                "yóu"
            ],
            "radicals": [
                "氵"
            ],
            "sid": [
                "0f3b2dc67ebd430f8da5e08f3d74811e"
            ],
            "stroke_count": [
                "12"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 33403438929,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.全体中的一份：～分（“分”读轻声）。外～。腹～。局～。全～。～件。～位（位置）。 2.机关企业按业务范围分设的单位：外交～。编辑～。～队（军队）。 3.具有统属关系：所～五十人。～下。～将。～属。～首。～落（luò）。 4.安置安排：～署。 5.量词：一～小说。三～汽车。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "部"
            ],
            "pinyin": [
                "bù"
            ],
            "radicals": [
                "阝"
            ],
            "sid": [
                "026682d03df941bb972b7984b0bf3683"
            ],
            "stroke_count": [
                "10"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 31943823937,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "[sǎ]：1.使水或其他东西分散地落下：～水。～扫。～泪。 2.东西散落：粮食～了。 3.姓。 [xǐ]：古同“洗”，洗涤。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "洒"
            ],
            "pinyin": [
                "sǎ",
                "xǐ"
            ],
            "radicals": [
                "氵"
            ],
            "sid": [
                "0d993f357f274367852fecfacdc692df"
            ],
            "stroke_count": [
                "9"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 31641829610,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.〔吩～〕见“吩”。 2.〔嘱～〕见“嘱”。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "咐"
            ],
            "pinyin": [
                "fù"
            ],
            "radicals": [
                "口"
            ],
            "sid": [
                "284f1df965bb463dbd12bc5ec6877b98"
            ],
            "stroke_count": [
                "8"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 33671874149,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.水的支流：九～（指长江支流之多）。 2.一个系统的分支：～系。～别。～性。党～。 3.作风，风度：正～。气～。～势。～头。 4.分配，指定：～赴。～驻。～遣。委～。 5.指摘：～不是。 6.量词（ａ．用于派别，如“两～的意见争论不休”；ｂ．用于景色、气象、语言等，前面用“一”字，如“一～胡言”、“好一～北国风光”）。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "派"
            ],
            "pinyin": [
                "pài"
            ],
            "radicals": [
                "氵"
            ],
            "sid": [
                "045c94f603444339b275534667e6fdad"
            ],
            "stroke_count": [
                "9"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 33889977290,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.冷，与“暑”相对：～冬。～色。～衣。～冽。～带。～战。～噤。～食（节名，在清明前一天。古人从这一天起不生火做饭，也有的地区把清明当作“寒食”）。～喧。～来暑往。唇亡齿～。 2.害怕：～心。 3.穷困，有时用作谦辞：～门。～伧。～舍。～窗（喻艰苦的学习环境）。～酸。～士（旧指贫穷的读书人）。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "寒"
            ],
            "pinyin": [
                "hán"
            ],
            "radicals": [
                "宀"
            ],
            "sid": [
                "3a1285c850be4d999a2dc3b601a3ea34"
            ],
            "stroke_count": [
                "12"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 32816239316,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "[báo]：1.厚度小的：～片。～饼。 2.冷淡，不热情：～待。 3.味道淡：～酒。 4.土地不肥沃：～田。 [bó]：1.义同（一），用于合成词或成语，如“厚薄”，“浅薄”，“尖嘴薄舌”等。 2.轻微，少：～礼。～产。～命。～寒。～酬。菲～。 3.不庄重，不厚道：～夫。～幸（负心）。～情。轻～。刻～。 4.轻视：鄙～。厚今～古。 5.不充实，不坚强：～弱。 6.迫近：～近。～暮（傍晚）。日～西山。 7.古同“箔”，帘子。 8.姓。 [bò]：[薄荷]，多年生草本植物。茎和叶有清凉香味，可入药。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "薄"
            ],
            "pinyin": [
                "báo",
                "bó",
                "bò"
            ],
            "sid": [
                "49faed4f427711e59e05c8e0eb15ce01"
            ],
            "stroke_count": [
                "16"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 31507612620,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.谷类植物的统称：～苗。～本科（单子叶植物的一科）。 2.古代指粟（谷子）。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "禾"
            ],
            "pinyin": [
                "hé"
            ],
            "radicals": [
                "禾"
            ],
            "sid": [
                "46121e436e014bf088d63fc4b75587ef"
            ],
            "stroke_count": [
                "5"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 31474065115,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "1.青绿色的玉石：～玉。 2.青绿色：～绿。金～辉煌。～空。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "碧"
            ],
            "pinyin": [
                "bì"
            ],
            "radicals": [
                "石"
            ],
            "sid": [
                "2f6316199bdd4e6ca94b9e093f6ce62d"
            ],
            "stroke_count": [
                "14"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 34326194552,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "山里的小河沟，泛指小河沟：山～。清～。～水。～涧。～谷。～壑。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "溪"
            ],
            "pinyin": [
                "xī"
            ],
            "radicals": [
                "氵"
            ],
            "sid": [
                "1c79de658e1947539b64eff34fe3544c"
            ],
            "stroke_count": [
                "13"
            ],
            "type": [
                "word"
            ]
        },
        {
            "_id": 31557948102,
            "_score": 1,
            "_type": "vertex",
            "_visited_num": 1,
            "definition": [
                "[fū]：1.旧时称成年男子：渔～。农～。万～不当之勇。 2.旧时称服劳役的人：～役。拉～。 3.〔～子〕ａ．旧时对学者的称呼；ｂ．旧时称老师；ｃ．旧时妻称夫；ｄ．称读古书而思想陈腐的人。 4.与妻结成配偶者：丈～。～妇。 [fú]：1.文言发语词：～天地者。 2.文言助词：逝者如斯～。 3.文言指示代词，相当于“这”或“那”：～猫至。"
            ],
            "line_type": [
                "水"
            ],
            "name": [
                "夫"
            ],
            "pinyin": [
                "fū",
                "fú"
            ],
            "sid": [
                "49ce2f66427711e5b81ec8e0eb15ce01"
            ],
            "stroke_count": [
                "4"
            ],
            "type": [
                "word"
            ]
        }
    ],
    "ret_type": "multiword",
    "hilight": {
        "radicals": "all",
        "strokes": "all",
        "line_type": "水"
    },
    "page_total": 79,
    "tag": {
        "tagLists": {
            "radicals": [
                "全部",
                "氵<span>(常见)</span>",
                "木",
                "艹",
                "口",
                "扌",
                "钅",
                "亻",
                "女",
                "虫",
                "土",
                "讠",
                "忄",
                "火",
                "纟",
                "竹",
                "山",
                "月",
                "阝",
                "石",
                "一<span>(1画)</span>",
                "丿",
                "乙",
                "丨",
                "乚",
                "丶",
                "亅",
                "刂<span>(2画)</span>",
                "力",
                "冫",
                "厂",
                "匚",
                "人",
                "亠",
                "十",
                "刀",
                "勹",
                "又",
                "冖",
                "冂",
                "八",
                "儿",
                "二",
                "卩",
                "厶",
                "几",
                "凵",
                "丷",
                "廴",
                "卜",
                "入",
                "匕",
                "匸",
                "辶<span>(3画)</span>",
                "犭",
                "宀",
                "广",
                "巾",
                "彳",
                "大",
                "囗",
                "马",
                "弓",
                "尸",
                "饣",
                "门",
                "子",
                "士",
                "寸",
                "夕",
                "小",
                "彡",
                "夂",
                "尢",
                "廾",
                "工",
                "巳",
                "弋",
                "彐",
                "干",
                "彑",
                "巛",
                "幺",
                "己",
                "兀",
                "飞",
                "川",
                "屮",
                "王<span>(4画)</span>",
                "日",
                "心",
                "礻",
                "贝",
                "欠",
                "攵",
                "牜",
                "歹",
                "毛",
                "车",
                "瓦",
                "戈",
                "水",
                "手",
                "灬",
                "方",
                "气",
                "殳",
                "止",
                "曰",
                "斤",
                "户",
                "牛",
                "犬",
                "见",
                "攴",
                "片",
                "文",
                "斗",
                "风",
                "耂",
                "爿",
                "爫",
                "比",
                "韦",
                "爪",
                "氏",
                "支",
                "厄",
                "父",
                "毋",
                "旡",
                "爻",
                "尣",
                "牙",
                "肀",
                "卝",
                "长",
                "目<span>(5画)</span>",
                "钅",
                "疒",
                "衤",
                "禾",
                "田",
                "穴",
                "鸟",
                "皿",
                "罒",
                "立",
                "白",
                "示",
                "皮",
                "矢",
                "玉",
                "瓜",
                "生",
                "用",
                "甘",
                "疋",
                "矛",
                "癶",
                "母",
                "玄",
                "龙",
                "业",
                "歺",
                "米<span>(6画)</span>",
                "舟",
                "耳",
                "羽",
                "衣",
                "页",
                "糹",
                "糸",
                "羊",
                "耒",
                "虍",
                "缶",
                "行",
                "臼",
                "舌",
                "血",
                "肉",
                "覀",
                "自",
                "至",
                "聿",
                "臣",
                "色",
                "而",
                "艮",
                "艸",
                "网",
                "齐",
                "先",
                "西",
                "言<span>(7画)</span>",
                "足",
                "車",
                "貝",
                "酉",
                "走",
                "見",
                "角",
                "豸",
                "豕",
                "身",
                "辛",
                "豆",
                "谷",
                "赤",
                "邑",
                "镸",
                "克",
                "辰",
                "里",
                "麦",
                "卤",
                "辵",
                "釒<span>(8画)</span>",
                "飠",
                "雨",
                "鱼",
                "門",
                "隹",
                "金",
                "齿",
                "青",
                "采",
                "非",
                "隶",
                "長",
                "阜",
                "靣",
                "靑",
                "頁<span>(9画)</span>",
                "革",
                "骨",
                "風",
                "鬼",
                "韋",
                "香",
                "音",
                "面",
                "韭",
                "首",
                "食",
                "馬<span>(10画)</span>",
                "髟",
                "鬥",
                "鬲",
                "高",
                "鬯",
                "鳥<span>(11画)</span>",
                "魚",
                "鹿",
                "麥",
                "黄",
                "鹵",
                "麻",
                "黑<span>(12画)</span>",
                "黽",
                "鼎",
                "黹",
                "黍",
                "鼠<span>(更多)</span>",
                "鼓",
                "鼻",
                "齊",
                "齒",
                "龍",
                "龠"
            ],
            "strokes": [
                "全部",
                "1画",
                "2画",
                "3画",
                "4画",
                "5画",
                "6画",
                "7画",
                "8画",
                "9画",
                "10画",
                "11画",
                "12画",
                "13画",
                "14画",
                "15画",
                "16画",
                "17画",
                "18画",
                "19画",
                "20画",
                "21画",
                "22画",
                "23画",
                "24画",
                "25画",
                "26画",
                "27画",
                "28画",
                "29画",
                "30画",
                "31画",
                "32画",
                "33画",
                "34画",
                "35画",
                "36画",
                "37画",
                "38画",
                "39画",
                "40画",
                "41画",
                "42画",
                "43画",
                "44画",
                "45画",
                "46画",
                "47画",
                "48画"
            ],
            "line_type": [
                "全部",
                "金",
                "木",
                "水",
                "火",
                "土"
            ]
        },
        "nameMapping": {
            "radicals": "部首",
            "strokes": "笔画",
            "line_type": "五行"
        },
        "activeTags": {
            "radicals": [
                "全部"
            ],
            "strokes": [
                "全部"
            ],
            "line_type": [
                "水"
            ]
        }
    },
    "result_type": "zici"
}


*/

type JsonData struct {
	Ret_num   int            `json:"ret_num"`
	Ret_array []JsonDataChar `json:"ret_array"`

	Ret_type   string `json:"ret_type"`
	Page_total int    `json:"page_total"`
}

type JsonDataChar struct {
	Id           int      `json:"_id"`          //   "_id": 30836532478,
	Score        int      `json:"_score"`       //"_score": 1,
	Type1        string   `json:"_type"`        //        "_type": "vertex",
	Visited_num  int      `json:"_visited_num"` // "_visited_num": 1,
	Definition   []string `json:"definition"`
	Line_type    []string `json:"line_type"`
	Name         []string `json:"name"`
	Pinyin       []string `json:"pinyin"`
	Radicals     []string `json:"radicals"`
	Sid          []string `json:"sid"`
	Stroke_count []string `json:"stroke_count"`
	Type         []string `json:"type"`
}
